app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-12-30 23:47:28.035171"], ["updated_at", "2016-12-30 23:47:28.035171"]]
---
  def create
    # create an item
    @student = Student.create(student_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    # show item with :id
    @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    # show edit form for item with :id
    @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2016-12-30 23:40:17.010779"], ["id", 1]]
---
  def update
    # update item with :id
    @student = Student.find(params[:id])
    @student.update(params.require(:student).permit(:first_name, :last_name))